Repository: GEARdHAX/Tantra
Catalog: frontend/app/lib/l10n/app_*.arb
Languages: hi, ne

# title
source: Hi, Agro User
hi: नमस्ते, कृषि उपयोगकर्ता
ne: नमस्ते, कृषि प्रयोगकर्ता

# checkField
source: Check Field Now
hi: अभी खेत जाँचें
ne: अब खेत जाँच गर्नुहोस्

source: Watering skipped
hi: सिंचाई रोकी गई
ne: सिँचाइ रोकियो

source: It's raining
hi: बारिश हो रही है
ne: पानी परिरहेको छ

source: Dashboard
hi: डैशबोर्ड
ne: ड्यासबोर्ड

source: Irrigation
hi: सिंचाई
ne: सिँचाइ

source: Analysis
hi: विश्लेषण
ne: विश्लेषण

source: Weather
hi: मौसम
ne: मौसम

source: Profile
hi: प्रोफ़ाइल
ne: प्रोफाइल

# farmDetailsTitle
source: Farm Details
hi: फार्म विवरण
ne: खेतीबारी विवरण

source: Farm Name / Location
hi: फार्म नाम / स्थान
ne: फार्म नाम / स्थान

source: Farm Size
hi: फार्म का आकार
ne: फार्म आकार

# primaryCrops
source: Primary Crops Grown
hi: मुख्य फसलें
ne: मुख्य बाली

source: Irrigation Method
hi: सिंचाई विधि
ne: सिँचाइ विधि

source: Power Source
hi: ऊर्जा स्रोत
ne: ऊर्जा स्रोत

# deviceSensorTitle
source: Device & Sensor Information
hi: डिवाइस और सेंसर जानकारी
ne: यन्त्र र सेन्सर जानकारी

source: Linked Devices
hi: कनेक्टेड डिवाइस
ne: जोडिएका यन्त्र

source: Active Sensors
hi: सक्रिय सेंसर
ne: सक्रिय सेन्सर

# connectivityStatus
source: Status of Connectivity
hi: कनेक्टिविटी स्थिति
ne: कनेक्टिभिटी स्थिति

# sampleDevices
source: Main Pump, Field Controller
hi: मुख्य पम्प, फील्ड कंट्रोलर
ne: मुख्य पम्प, फील्ड कन्ट्रोलर

# sampleSensors
source: Soil Moisture, Temp, Humidity
hi: मिट्टी नमी, तापमान, आर्द्रता
ne: माटो चिस्यान, तापक्रम, आर्द्रता

# preferencesSettingsTitle
source: Preferences & Settings
hi: वरीयताएँ और सेटिंग्स
ne: रुचि र सेटिङ

source: Notification Preferences
hi: सूचना वरीयताएँ
ne: सूचना रुचि

source: Voice Alert Language
hi: वॉयस अलर्ट भाषा
ne: आवाज अलर्ट भाषा

source: Dashboard Customization
hi: डैशबोर्ड अनुकूलन
ne: ड्यासबोर्ड अनुकूलन

# privacySecurity
source: Privacy & Security Settings
hi: गोपनीयता और सुरक्षा
ne: गोपनीयता र सुरक्षा

source: Preferred Language
hi: पसंदीदा भाषा
ne: मनपर्ने भाषा

# langEnglish
source: English
hi: अंग्रेज़ी
ne: अंग्रेजी

# langHindi
source: Hindi
hi: हिंदी
ne: हिन्दी

# langNepali
source: Nepali
hi: नेपाली
ne: नेपाली

# dashboardCustomizationOptions
source: Health, Weather
hi: स्वास्थ्य, मौसम
ne: स्वास्थ्य, मौसम

# privacySecurityHint
source: Manage data sharing & login security
hi: डेटा शेयरिंग और लॉगिन सुरक्षा प्रबंधित करें
ne: डेटा साझेदारी र लगइन सुरक्षा प्रबन्ध गर्नुहोस्

# achievementsTitle
source: Achievements / Activity
hi: उपलब्धियाँ / गतिविधि
ne: उपलब्धि / गतिविधि

# totalAlertsResponded
source: Total Alerts Responded To
hi: कुल अलर्ट जिनका जवाब दिया
ne: जवाफ दिएका अलर्ट

source: Water Saved
hi: बचाया गया पानी
ne: बचत भएको पानी

# energyGenerated
source: Energy Generated from Renewables
hi: नवीकरणीय से उत्पन्न ऊर्जा
ne: नवीकरणीयबाट उत्पादित ऊर्जा

source: Badges / Rewards
hi: बैज / रिवार्ड्स
ne: ब्याज/पुरस्कार

# sampleBadges
source: Early Adopter, Water Saver
hi: अर्ली अडॉप्टर, वाटर सेवर
ne: अर्ली एडप्टर, वाटर सेभर

# supportTitle
source: Support
hi: सहायता
ne: समर्थन

source: Help / User Guide
hi: मदद / उपयोगकर्ता मार्गदर्शिका
ne: मद्दत / प्रयोगकर्ता मार्गदर्शिका

source: Contact Support
hi: समर्थन से संपर्क करें
ne: समर्थन सम्पर्क

# helpIntro
source: This guide explains the basics of using AgroSmart.
hi: यह गाइड AgroSmart का उपयोग समझाती है।
ne: यो गाइडले AgroSmart चलाउने आधारहरू बुझाउँछ।

# helpStepDashboard
source: Dashboard shows quick stats and alerts.
hi: डैशबोर्ड त्वरित आँकड़े और अलर्ट दिखाता है।
ne: ड्यासबोर्डले चाँडो तथ्याङ्क र अलर्ट देखाउँछ।

# helpStepIrrigation
source: Irrigation lets you view and control watering.
hi: सिंचाई स्क्रीन से पानी नियंत्रित/देखें।
ne: सिँचाइबाट पानी नियन्त्रित/हेर्न सकिन्छ।

# helpStepWeather
source: Weather provides local forecasts and rain alerts.
hi: मौसम में स्थानीय पूर्वानुमान और बारिश अलर्ट हैं।
ne: मौसममा स्थानीय पूर्वानुमान र वर्षा अलर्ट हुन्छ।

# helpStepProfile
source: Profile stores your farm, devices and preferences.
hi: प्रोफ़ाइल में फार्म, डिवाइस और वरीयताएँ होती हैं।
ne: प्रोफाइलमा फार्म, यन्त्र र रुचिहरू हुन्छन्।

# helpContact
source: Need help? Email support@agrosmart.example
hi: मदद चाहिए? support@agrosmart.example पर ईमेल करें
ne: सहायत्ता चाहिन्छ? support@agrosmart.example मा इमेल गर्नुहोस्
